Repository: xcv58/MacTools
Catalog: Plugins/WindowLayouts/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# settings.modifierDrag.hud.movePointer
source: 移动指针以调整窗口位置
ar: حرك المؤشر لتغيير موضع النافذة
de: Bewege den Zeiger, um das Fenster neu zu positionieren
en: Move the pointer to reposition the window
es: Mueve el puntero para reposicionar la ventana
fr: Déplacez le pointeur pour repositionner la fenêtre
ja: ポインタを移動してウィンドウの位置を変更します
ko: 포인터를 이동하여 창 위치를 변경하세요.
pt: Mova o ponteiro para reposicionar a janela
ru: Переместите указатель, чтобы изменить положение окна
tr: Pencereyi yeniden konumlandırmak için işaretçiyi hareket ettirin
zh_hant: 移動指標以調整視窗位置

# settings.modifierDrag.hud.movingWindow
source: 正在移动窗口 — 松开按键以完成
ar: جارٍ نقل النافذة — حرّر المفاتيح للإنهاء
de: Fenster wird verschoben – Tasten zum Abschließen loslassen
en: Moving window — release the keys to finish
es: Moviendo la ventana — suelta las teclas para terminar
fr: Déplacement de la fenêtre — relâchez les touches pour terminer
ja: ウィンドウを移動中 — キーを放すと完了
ko: 윈도우 이동 중 — 완료하려면 키를 놓으세요
pt: Movendo janela — solte as teclas para finalizar
ru: Перемещение окна — для завершения отпустите клавиши.
tr: Pencere taşınıyor — bitirmek için tuşları bırakın
zh_hant: 正在移動視窗 — 放開按鍵以完成

# settings.preset.title
source: 快捷键预设
ar: إعداد مسبق للاختصارات
de: Tastenkombinations-Voreinstellung
en: Shortcut Preset
es: Preajuste de atajos de teclado
fr: Préréglage de raccourci
ja: ショートカットプリセット
ko: 단축키 프리셋
pt: Predefinição de atalho
ru: Предустановка сочетаний клавиш
tr: Kısayol Hazır Ayarı
zh_hant: 快速鍵預設

# settings.preset.none
source: 无
ar: لا شيء
de: Keine
en: None
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
pt: Nenhuma
ru: Нет
tr: Yok
zh_hant: 無

# settings.preset.unavailable
source: 当前无法应用快捷键预设。
ar: لا يمكن تطبيق الإعداد المسبق للاختصار الآن.
de: Die Tastenkombinations-Vorgabe kann derzeit nicht angewendet werden.
en: The shortcut preset cannot be applied right now.
es: No se puede aplicar el preajuste de atajos de teclado en este momento.
fr: Le préréglage de raccourcis ne peut pas être appliqué pour le moment.
ja: 現在、ショートカット プリセットを適用できません。
ko: 지금은 단축키 사전 설정을 적용할 수 없습니다.
pt: A predefinição de atalho não pode ser aplicada no momento.
ru: В данный момент невозможно применить предустановку сочетания клавиш.
tr: Kısayol hazır ayarı şu anda uygulanamıyor.
zh_hant: 目前無法套用快速鍵預設。

# settings.preset.sectionTitle
source: 快捷键预设
ar: الإعدادات المسبقة للاختصارات
de: Tastenkombinations-Vorgaben
en: Shortcut Presets
es: Preajustes de atajos de teclado
fr: Préréglages de raccourcis
ja: ショートカットプリセット
ko: 단축키 프리셋
pt: Predefinições de atalho
ru: Предустановки сочетаний клавиш
tr: Kısayol Hazır Ayarları
zh_hant: 快速鍵預設

# settings.preset.current
source: 当前快捷键方案
ar: نظام الاختصارات الحالي
de: Aktuelles Tastenkombinations-Schema
en: Current Shortcut Scheme
es: Esquema actual de atajos de teclado
fr: Configuration actuelle des raccourcis
ja: 現在のショートカット構成
ko: 현재 단축키 구성표
pt: Esquema de atalho atual
ru: Текущая схема сочетаний клавиш
tr: Geçerli Kısayol Seti
zh_hant: 目前快速鍵方案

# settings.preset.currentDescription
source: 打开预设助手，先查看更改和冲突，再决定是否应用。
ar: افتح مساعد الإعدادات المسبقة لمراجعة التغييرات والتعارضات قبل التطبيق.
de: Öffne den Vorgaben-Assistenten, um Änderungen und Konflikte vor dem Anwenden zu überprüfen.
en: Open the preset assistant to review changes and conflicts before applying.
es: Abre el asistente de preajustes para revisar los cambios y conflictos antes de aplicarlos.
fr: Ouvrez l'assistant de préréglage pour examiner les modifications et les conflits avant de les appliquer.
ja: プリセット アシスタントを開いて、適用する前に変更と競合を確認します。
ko: 사전 설정 도우미를 열어 적용하기 전에 변경 사항과 충돌을 검토하세요.
pt: Abra o assistente de predefinições para revisar alterações e conflitos antes de aplicar.
ru: Откройте помощник по настройкам, чтобы просмотреть изменения и конфликты перед применением.
tr: Uygulamadan önce değişiklikleri ve çakışmaları incelemek için hazır ayar asistanını açın.
zh_hant: 開啟預設助理，先查看變更和衝突，再決定是否套用。

# settings.preset.currentBinding
source: 当前
ar: الحالي
de: Aktuell
en: Current
es: Actual
fr: Actuel
ja: 現在
ko: 현재
pt: Atual
ru: Текущий
tr: Geçerli
zh_hant: 目前

# settings.preset.proposedBinding
source: 建议
ar: مقترح
de: Vorgeschlagen
en: Proposed
es: Propuesto
fr: Proposé
ja: 変更案
ko: 제안됨
pt: Proposta
ru: Предлагается
tr: Önerilen
zh_hant: 建議

# settings.preset.changeButton
source: 更改…
ar: تغيير…
de: Ändern…
en: Change…
es: Cambiar…
fr: Changer…
ja: 変更…
ko: 변경…
pt: Alterar…
ru: Изменить…
tr: Değiştir…

# settings.preset.custom
source: 自定义
ar: مخصص
de: Benutzerdefiniert
en: Custom
es: Personalizado
fr: Personnalisé
ja: カスタム
ko: 사용자 지정
pt: Personalizado
ru: Пользовательский
tr: Özel
zh_hant: 自訂

# settings.preset.selectionDescription
source: 选择预设只会更新预览，不会立即应用。
ar: يؤدي تحديد إعداد مسبق إلى تحديث المعاينة فقط؛ لا يتم تطبيقه على الفور.
de: Das Auswählen einer Vorgabe aktualisiert nur die Vorschau; sie wird nicht sofort angewendet.
en: Selecting a preset only updates the preview; it is not applied immediately.
es: Al seleccionar un ajuste preestablecido solo se actualiza la vista previa; no se aplica inmediatamente.
fr: La sélection d'un préréglage met uniquement à jour l'aperçu ; il n'est pas appliqué immédiatement.
ja: プリセットを選択すると、プレビューのみが更新されます。すぐには適用されません。
ko: 사전 설정을 선택하면 미리보기만 업데이트됩니다. 즉시 적용되지는 않습니다.
pt: Selecionar uma predefinição apenas atualiza a visualização; ela não é aplicada imediatamente.
ru: Выбор предустановки обновляет только предварительный просмотр; сама предустановка не применяется сразу.
tr: Hazır ayar seçmek yalnızca önizlemeyi günceller; hemen uygulanmaz.
zh_hant: 選擇預設只會更新預覽，不會立即套用。

# settings.preset.sheetTitle
source: 更改快捷键预设
ar: تغيير الإعداد المسبق للاختصار
de: Tastenkombinations-Vorgabe ändern
en: Change Shortcut Preset
es: Cambiar preajuste de atajos de teclado
fr: Modifier le préréglage de raccourcis
ja: ショートカットプリセットの変更
ko: 단축키 프리셋 변경
pt: Alterar predefinição de atalho
ru: Изменение предустановки сочетаний клавиш
tr: Kısayol Hazır Ayarını Değiştir
zh_hant: 更改快速鍵預設

# settings.preset.sheetDescription
source: 选择预设并逐项查看更改；在点击应用前，不会修改任何快捷键。
ar: اختر إعدادًا مسبقًا وراجع كل تغيير. لا تتغير الاختصارات حتى تقوم بتطبيقها.
de: Wähle eine Vorgabe aus und überprüfe alle Änderungen. Es werden keine Tastenkombinationen geändert, bis du die Vorgabe anwendest.
en: Choose a preset and review every change. No shortcuts change until you apply it.
es: Elige un preajuste y revisa cada cambio. Los atajos de teclado solo cambiarán cuando lo apliques.
fr: Choisissez un préréglage et examinez chaque modification. Aucun raccourci ne change jusqu'à ce que vous l'appliquiez.
ja: プリセットを選択し、すべての変更を確認します。適用するまでショートカットは変更されません。
ko: 사전 설정을 선택하고 모든 변경 사항을 검토하세요. 적용하기 전까지는 단축키가 변경되지 않습니다.
pt: Escolha uma predefinição e revise cada alteração. Nenhum atalho muda até que você aplique a predefinição.
ru: Выберите набор настроек и просмотрите каждое изменение. Никакие сочетания клавиш не меняются, пока вы их не примените.
tr: Bir hazır ayar seçin ve tüm değişiklikleri inceleyin. Uygulayana kadar hiçbir kısayol değişmez.
zh_hant: 選擇預設並逐項查看變更；在點按套用前，不會修改任何快速鍵。

# settings.preset.sheetPicker
source: 要预览的预设
ar: الإعداد المسبق للمعاينة
de: Voreinstellung zur Vorschau
en: Preset to Preview
es: Preajuste para revisar
fr: Préréglage à prévisualiser
ja: プレビューするプリセット
ko: 미리보기용 프리셋
pt: Predefinição para visualização
ru: Предустановка для просмотра
tr: Önizlenecek Hazır Ayar
zh_hant: 要預覽的預設

# settings.preset.appliedStatus
source: 已应用
ar: تم التطبيق
de: Angewendet
en: Applied
es: Aplicado
fr: Appliqué
ja: 適用済み
ko: 적용됨
pt: Aplicado
ru: Применено
tr: Uygulandı
zh_hant: 已套用

# settings.preset.notAppliedStatus
source: 尚未应用
ar: غير مطبق
de: Nicht angewendet
en: Not Applied
es: No aplicado
fr: Non appliqué
ja: 未適用
ko: 미적용
pt: Não aplicado
ru: Не применено
tr: Uygulanmadı
zh_hant: 尚未套用

# settings.preset.willChange
source: 将更改
ar: سوف يتغير
de: Wird geändert
en: Will Change
es: Cambiará
fr: Va changer
ja: 変わります
ko: 변경 예정
pt: Mudará
ru: Изменится
tr: Değişecek
zh_hant: 將更改

# settings.preset.unchanged
source: 无更改
ar: لا تغيير
de: Keine Änderung
en: No Change
es: Sin cambios
fr: Aucun changement
ja: 変更なし
ko: 변경 없음
pt: Sem alteração
ru: Без изменений
tr: Değişiklik Yok
zh_hant: 無變更

# settings.preset.conflictOwner
source: 与“%@”冲突
ar: يتعارض مع "%@"
de: Konflikt mit „%@“
en: Conflicts with “%@”
es: En conflicto con «%@»
fr: En conflit avec « %@ »
ja: 「%@」と競合します
ko: ‘%@’과(와) 충돌
pt: Conflita com “%@”
ru: Конфликт с «%@»
tr: “%@” ile çakışıyor
zh_hant: 與「%@」衝突

# settings.preset.resolveConflicts
source: 请先解决标记的快捷键冲突，再应用预设。
ar: قم بحل تعارضات الاختصارات المحددة قبل تطبيق هذا الإعداد المسبق.
de: Beheben Sie die markierten Tastenkombinationskonflikte, bevor Sie diese Voreinstellung anwenden.
en: Resolve the marked shortcut conflicts before applying this preset.
es: Resuelve los conflictos de atajos de teclado marcados antes de aplicar este preajuste.
fr: Résolvez les conflits de raccourcis marqués avant d'appliquer ce préréglage.
ja: このプリセットを適用する前に、マークされたショートカットの競合を解決してください。
ko: 이 사전 설정을 적용하기 전에 표시된 단축키 충돌을 해결하세요.
pt: Resolva os conflitos de atalho marcados antes de aplicar esta predefinição.
ru: Устраните отмеченные конфликты сочетаний клавиш перед применением этой предустановки.
tr: Bu hazır ayarı uygulamadan önce işaretli kısayol çakışmalarını çözün.
zh_hant: 請先解決標記的快速鍵衝突，再套用預設。

# settings.preset.notAppliedDescription
source: 在点击“应用预设”前，不会修改任何快捷键。
ar: لا تتغير الاختصارات حتى تقوم بالنقر فوق تطبيق الإعداد المسبق.
de: Die Tastenkombinationen ändern sich erst, wenn Sie auf „Voreinstellung anwenden“ klicken.
en: No shortcuts change until you click Apply Preset.
es: Los atajos de teclado solo cambiarán cuando hagas clic en Aplicar preajuste.
fr: Aucun raccourci ne change jusqu'à ce que vous cliquiez sur Appliquer le préréglage.
ja: [プリセットを適用]をクリックするまでショートカットは変更されません。
ko: ‘프리셋 적용’을 클릭하기 전까지 단축키는 변경되지 않습니다.
pt: Nenhum atalho será alterado até você clicar em Aplicar predefinição.
ru: Сочетания клавиш не изменяются, пока вы не нажмете «Применить предустановку».
tr: Hazır Ayarı Uygula düğmesine tıklayana kadar hiçbir kısayol değişmez.
zh_hant: 在點按「套用預設」前，不會修改任何快速鍵。

# settings.preset.preview
source: 更改预览
ar: معاينة التغييرات
de: Änderungsvorschau
en: Change Preview
es: Vista previa de los cambios
fr: Aperçu des modifications
ja: 変更のプレビュー
ko: 변경 사항 미리보기
pt: Pré-visualização de alterações
ru: Предварительный просмотр изменений
tr: Değişiklik Önizlemesi
zh_hant: 變更預覽

# settings.preset.previewUnavailable
source: 当前无法预览。
ar: المعاينة غير متاحة الآن.
de: Vorschau derzeit nicht verfügbar.
en: Preview is unavailable right now.
es: La vista previa no está disponible en este momento.
fr: L'aperçu n'est pas disponible pour le moment.
ja: 現在プレビューを利用できません。
ko: 지금은 미리보기를 사용할 수 없습니다.
pt: A visualização não está disponível no momento.
ru: Предварительный просмотр сейчас недоступен.
tr: Önizleme şu anda kullanılamıyor.
zh_hant: 目前無法預覽。

# settings.preset.conflictCount
source: %d 个快捷键冲突
ar: تعارضات الاختصارات: %d
de: %d Konflikte bei Tastenkombinationen
en: %d shortcut conflicts
es: %d conflictos de atajos de teclado
fr: %d conflits de raccourcis
ja: %d 件のショートカットの競合
ko: 단축키 충돌 %d개
pt: %d conflitos de atalho
ru: Конфликты сочетаний клавиш: %d
tr: %d kısayol çakışması
zh_hant: %d 個快速鍵衝突

# settings.preset.conflictCountOne
source: 1 个快捷键冲突
ar: تعارض واحد في الاختصارات
de: 1 Konflikt bei Tastenkombinationen
en: 1 shortcut conflict
es: 1 conflicto de atajo de teclado
fr: 1 conflit de raccourci
ja: 1 つのショートカットの競合
ko: 단축키 충돌 1개
pt: 1 conflito de atalho
ru: 1 конфликт сочетаний клавиш
tr: 1 kısayol çakışması
zh_hant: 1 個快速鍵衝突

# settings.preset.alreadyApplied
source: 当前快捷键已与此预设一致。
ar: تتطابق هذه الاختصارات بالفعل مع هذا الإعداد المسبق.
de: Diese Tastenkombinationen entsprechen bereits dieser Voreinstellung.
en: These shortcuts already match this preset.
es: Estos atajos ya coinciden con este ajuste preestablecido.
fr: Ces raccourcis correspondent déjà à ce préréglage.
ja: これらのショートカットはすでにこのプリセットと一致しています。
ko: 이 단축키는 이미 이 사전 설정과 일치합니다.
pt: Esses atalhos já correspondem a esta predefinição.
ru: Эти сочетания клавиш уже соответствуют этому набору настроек.
tr: Bu kısayollar zaten bu hazır ayarla eşleşiyor.
zh_hant: 目前快速鍵已與此預設一致。

# settings.preset.changeCount
source: %d 项更改
ar: التغييرات: %d
de: %d Änderungen
en: %d changes
es: %d cambios
fr: %d modifications
ja: %d 件の変更
ko: 변경 사항 %d개
pt: %d alterações
ru: Изменения: %d
tr: %d değişiklik
zh_hant: %d 項變更

# settings.preset.changeCountOne
source: 1 项更改
ar: تغيير واحد
de: 1 Änderung
en: 1 change
es: 1 cambio
fr: 1 changement
ja: 1 件の変更
ko: 변경 1개
pt: 1 alteração
ru: 1 изменение
tr: 1 değişiklik
zh_hant: 1 項變更

# settings.preset.applyTitle
source: 应用快捷键预设
ar: تطبيق الإعداد المسبق للاختصار
de: Tastenkombinations-Voreinstellung anwenden
en: Apply Shortcut Preset
es: Aplicar preajuste de atajos de teclado
fr: Appliquer le préréglage de raccourcis
ja: ショートカットプリセットを適用
ko: 단축키 프리셋 적용
pt: Aplicar predefinição de atalho
ru: Применить предустановку сочетаний клавиш
tr: Kısayol Hazır Ayarını Uygula
zh_hant: 套用快速鍵預設

# settings.preset.applyDescription
source: 仅在确认后替换预览中列出的窗口布局快捷键。
ar: استبدل اختصارات تخطيط النافذة التي تمت معاينتها فقط بعد التأكيد.
de: Tastenkombinationen für das Fensterlayout aus der Vorschau erst nach Bestätigung ersetzen.
en: Only replace the previewed Window Layouts shortcuts after confirmation.
es: Sustituye los atajos de teclado de Diseños de ventanas mostrados en la vista previa solo tras la confirmación.
fr: Seuls les raccourcis prévisualisés de Disposition des fenêtres seront remplacés après confirmation.
ja: 確認後に、プレビューに表示されたウィンドウレイアウトのショートカットだけを置き換えます。
ko: 미리보기에 표시된 윈도우 레이아웃 단축키만 확인 후 교체합니다.
pt: Substitua apenas os atalhos de layout de janela visualizados após a confirmação.
ru: После подтверждения заменяются только сочетания клавиш плагина «Расположение окон», показанные в предварительном просмотре.
tr: Önizlenen pencere düzeni kısayolları yalnızca onaydan sonra değiştirilir.
zh_hant: 僅在確認後取代預覽中列出的視窗佈局快速鍵。

# settings.preset.applyButton
source: 应用预设
ar: تطبيق الإعداد المسبق
de: Voreinstellung anwenden
en: Apply Preset
es: Aplicar preajuste
fr: Appliquer le préréglage
ja: プリセットを適用
ko: 프리셋 적용
pt: Aplicar predefinição
ru: Применить предустановку
tr: Hazır Ayarı Uygula
zh_hant: 套用預設

# settings.preset.confirmTitle
source: 应用“%@”？
ar: تطبيق "%@"؟
de: „%@“ anwenden?
en: Apply “%@”?
es: ¿Aplicar “%@”?
fr: Appliquer « %@ » ?
ja: 「%@」を適用しますか？
ko: ‘%@’을(를) 적용하시겠습니까?
pt: Aplicar “%@”?
ru: Применить «%@»?
tr: “%@” uygulansın mı?
zh_hant: 套用「%@」？

# settings.preset.confirmMessage
source: 预览中有变化的窗口布局快捷键将被替换。
ar: سيتم استبدال اختصارات تخطيط النافذة التي تم وضع علامة عليها على أنها تغيرت في المعاينة.
de: Als geändert markierte Tastenkombinationen für das Fensterlayout werden ersetzt.
en: Window Layouts shortcuts marked as changed in the preview will be replaced.
es: Se sustituirán los atajos de teclado de Diseños de ventanas marcados como modificados en la vista previa.
fr: Les raccourcis de disposition des fenêtres marqués comme modifiés dans l'aperçu seront remplacés.
ja: プレビューで変更対象としてマークされたウィンドウレイアウトのショートカットを置き換えます。
ko: 미리보기에서 변경 대상으로 표시된 윈도우 레이아웃 단축키가 교체됩니다.
pt: Os atalhos de layout de janela marcados como alterados na visualização serão substituídos.
ru: Сочетания клавиш плагина «Расположение окон», отмеченные как измененные в предварительном просмотре, будут заменены.
tr: Önizlemede değişecek olarak işaretlenen pencere düzeni kısayollarının yerine yenileri konacak.
zh_hant: 預覽中有變更的視窗佈局快速鍵將被取代。

# settings.preset.confirmButton
source: 应用
ar: تطبيق
de: Anwenden
en: Apply
es: Aplicar
fr: Appliquer
ja: 適用
ko: 적용
pt: Aplicar
ru: Применить
tr: Uygula
zh_hant: 套用

# settings.preset.cancelButton
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# settings.preset.previewConflict
source: — 与“%@”冲突
ar: — يتعارض مع "%@"
de: — steht im Konflikt mit „%@“
en: — conflicts with “%@”
es: — entra en conflicto con “%@”
fr: — est en conflit avec « %@ »
ja: — 「%@」と競合します
ko: — ‘%@’과(와) 충돌
pt: — conflita com “%@”
ru: — конфликтует с «%@»
tr: — “%@” ile çakışıyor
zh_hant: — 與「%@」衝突

# settings.preset.unassigned
source: 未分配
ar: غير معين
de: Nicht zugewiesen
en: Unassigned
es: No asignado
fr: Non attribué
ja: 未割り当て
ko: 할당되지 않음
pt: Não atribuído
ru: Не назначено
tr: Atanmamış
zh_hant: 未指派

# settings.preset.retiredNextDesktop
source: 已移除：移到下一个桌面
ar: تمت الإزالة: الانتقال إلى سطح المكتب التالي
de: Entfernt: Auf den nächsten Schreibtisch verschieben
en: Removed: Move to Next Desktop
es: Eliminado: Mover al siguiente escritorio
fr: Supprimé : déplacer vers le bureau suivant
ja: 削除: 次のデスクトップに移動
ko: 제거됨: 다음 데스크탑으로 이동
pt: Removido: Mover para a próxima área de trabalho
ru: Удалено: переместить на следующий рабочий стол
tr: Kaldırıldı: Sonraki Masaüstüne Taşı
zh_hant: 已移除：移到下一個桌面

# settings.preset.retiredPreviousDesktop
source: 已移除：移到上一个桌面
ar: تمت الإزالة: الانتقال إلى سطح المكتب السابق
de: Entfernt: Auf den vorherigen Schreibtisch verschieben
en: Removed: Move to Previous Desktop
es: Eliminado: Mover al escritorio anterior
fr: Supprimé : déplacer vers le bureau précédent
ja: 削除: 前のデスクトップに移動
ko: 제거됨: 이전 데스크탑으로 이동
pt: Removido: mover para a área de trabalho anterior
ru: Удалено: переместить на предыдущий рабочий стол
tr: Kaldırıldı: Önceki Masaüstüne Taşı
zh_hant: 已移除：移到上一個桌面

# settings.custom.title
source: 自定义布局
ar: التخطيطات المخصصة
de: Benutzerdefinierte Layouts
en: Custom Layouts
es: Diseños personalizados
fr: Dispositions personnalisées
ja: カスタムレイアウト
ko: 맞춤 레이아웃
pt: Layouts personalizados
ru: Пользовательские макеты
tr: Özel Düzenler
zh_hant: 自訂佈局

# settings.custom.description
source: 可组合相对或固定大小、九点定位和偏移，并作为快捷键或 Run Link 使用。
ar: ادمج الأبعاد النسبية أو الثابتة، وتسعة مواضع ارتكاز، وإزاحات للاختصارات أو روابط التشغيل.
de: Kombinieren Sie relative oder feste Abmessungen, neun Ankerpositionen und Versätze für Tastenkombinationen oder Ausführungslinks.
en: Combine relative or fixed dimensions, nine anchor positions, and offsets for shortcuts or Run Links.
es: Combina dimensiones relativas o fijas, nueve posiciones de anclaje y desplazamientos para atajos de teclado o enlaces de ejecución.
fr: Combinez des dimensions relatives ou fixes, neuf positions d'ancrage et des décalages pour les raccourcis ou les liens d'exécution.
ja: 相対サイズまたは固定サイズ、9 つの基準位置、オフセットを組み合わせ、ショートカットや Run Link から利用できます。
ko: 단축키 또는 실행 링크로 사용할 수 있도록 상대 크기 또는 고정 크기, 9개의 앵커 위치 및 오프셋을 조합합니다.
pt: Combine dimensões relativas ou fixas, nove posições de ancoragem e deslocamentos para atalhos ou links de execução.
ru: Комбинируйте относительные или фиксированные размеры, девять позиций привязки и смещения для сочетаний клавиш или ссылок запуска.
tr: Göreli veya sabit boyutları, dokuz çapa konumunu ve ofsetleri birleştirin; kısayol veya Run Link olarak kullanın.
zh_hant: 可組合相對或固定大小、九點定位和偏移，並作為快速鍵或 Run Link 使用。

# settings.custom.add.title
source: 创建自定义布局
ar: إنشاء تخطيط مخصص
de: Benutzerdefiniertes Layout erstellen
en: Create Custom Layout
es: Crear diseño personalizado
fr: Créer une disposition personnalisée
ja: カスタムレイアウトを作成
ko: 사용자 정의 레이아웃 생성
pt: Criar layout personalizado
ru: Создать собственный макет
tr: Özel Düzen Oluştur
zh_hant: 建立自訂佈局

# settings.custom.add.button
source: 创建
ar: إنشاء
de: Erstellen
en: Create
es: Crear
fr: Créer
ja: 作成
ko: 만들기
pt: Criar
ru: Создать
tr: Oluştur
zh_hant: 建立

# settings.custom.preview
source: 布局预览
ar: معاينة التخطيط
de: Layout-Vorschau
en: Layout Preview
es: Vista previa del diseño
fr: Aperçu de la disposition
ja: レイアウトプレビュー
ko: 레이아웃 미리보기
pt: Visualização do layout
ru: Предварительный просмотр макета
tr: Düzen Önizlemesi
zh_hant: 佈局預覽

# settings.custom.shortcut
source: 全局快捷键
ar: اختصار عام
de: Globale Tastenkombination
en: Global Shortcut
es: Atajo global
fr: Raccourci global
ja: グローバルショートカット
ko: 전역 단축키
pt: Atalho global
ru: Глобальное сочетание клавиш
tr: Genel Kısayol
zh_hant: 全域快速鍵

# settings.custom.shortcut.clear
source: 清除快捷键
ar: مسح الاختصار
de: Tastenkombination löschen
en: Clear Shortcut
es: Borrar atajo
fr: Effacer le raccourci
ja: ショートカットを消去
ko: 단축키 지우기
pt: Limpar atalho
ru: Очистить сочетание клавиш
tr: Kısayolu Temizle
zh_hant: 清除快速鍵

# settings.custom.name
source: 名称
ar: الاسم
de: Name
en: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt: Nome
ru: Название
tr: Ad
zh_hant: 名稱

# settings.custom.widthMode
source: 宽度模式
ar: وضع العرض
de: Breitenmodus
en: Width Mode
es: Modo de ancho
fr: Mode largeur
ja: 幅モード
ko: 너비 모드
pt: Modo de largura
ru: Режим ширины
tr: Genişlik Modu
zh_hant: 寬度模式

# settings.custom.width
source: 宽度
ar: العرض
de: Breite
en: Width
es: Ancho
fr: Largeur
ja: 幅
ko: 너비
pt: Largura
ru: Ширина
tr: Genişlik
zh_hant: 寬度

# settings.custom.heightMode
source: 高度模式
ar: وضع الارتفاع
de: Höhenmodus
en: Height Mode
es: Modo de altura
fr: Mode hauteur
ja: 高さモード
ko: 높이 모드
pt: Modo de altura
ru: Режим высоты
tr: Yükseklik Modu

# settings.custom.height
source: 高度
ar: الارتفاع
de: Höhe
en: Height
es: Alto
fr: Hauteur
ja: 高さ
ko: 높이
pt: Altura
ru: Высота
tr: Yükseklik

# settings.custom.anchor
source: 固定位置
ar: نقطة الارتكاز
de: Anker
en: Anchor
es: Ancla
fr: Point d’ancrage
ja: 基準位置
ko: 앵커
pt: Âncora
ru: Точка привязки
tr: Çapa

# settings.custom.offsetX
source: 水平偏移
ar: الإزاحة الأفقية
de: Horizontaler Versatz
en: Horizontal Offset
es: Desplazamiento horizontal
fr: Décalage horizontal
ja: 水平オフセット
ko: 수평 오프셋
pt: Deslocamento horizontal
ru: Горизонтальное смещение
tr: Yatay Ofset

# settings.custom.offsetY
source: 垂直偏移
ar: الإزاحة العمودية
de: Vertikaler Versatz
en: Vertical Offset
es: Desplazamiento vertical
fr: Décalage vertical
ja: 垂直オフセット
ko: 수직 오프셋
pt: Deslocamento vertical
ru: Вертикальное смещение
tr: Dikey Ofset

# settings.custom.external
source: 允许 Run Link
ar: السماح بروابط التشغيل
de: Ausführungslink erlauben
en: Allow Run Link
es: Permitir enlace de ejecución
fr: Autoriser le lien d'exécution
ja: Run Link を許可
ko: 실행 링크 허용
pt: Permitir link de execução
ru: Разрешить запуск по ссылке
tr: Run Link'e İzin Ver
zh_hant: 允許 Run Link

# settings.custom.duplicate
source: 复制命令
ar: إنشاء نسخة من الأمر
de: Befehl duplizieren
en: Duplicate Command
es: Duplicar comando
fr: Dupliquer la commande
ja: コマンドを複製
ko: 명령 복제
pt: Duplicar comando
ru: Дублировать команду
tr: Komutu Çoğalt
zh_hant: 複製指令

# settings.custom.duplicate.button
source: 复制
ar: إنشاء نسخة
de: Duplizieren
en: Duplicate
es: Duplicar
fr: Dupliquer
ja: 複製
ko: 복제
pt: Duplicar
ru: Дублировать
tr: Çoğalt
zh_hant: 複製

# settings.custom.delete
source: 删除命令
ar: حذف الأمر
de: Befehl löschen
en: Delete Command
es: Eliminar comando
fr: Supprimer la commande
ja: コマンドを削除
ko: 명령 삭제
pt: Excluir comando
ru: Удалить команду
tr: Komutu Sil
zh_hant: 刪除指令

# settings.custom.delete.shortcutUnavailable
source: 删除前无法读取此布局的快捷键。
ar: تعذرت قراءة اختصار هذا التخطيط قبل الحذف.
de: Die Tastenkombination für dieses Layout konnte vor dem Löschen nicht gelesen werden.
en: The shortcut for this layout could not be read before deletion.
es: No se pudo leer el atajo de teclado de este diseño antes de eliminarlo.
fr: Le raccourci de cette disposition n’a pas pu être lu avant suppression.
ja: 削除する前に、このレイアウトのショートカットを読み込むことができませんでした。
ko: 삭제 전에 이 레이아웃의 단축키를 읽지 못했습니다.
pt: O atalho para este layout não pôde ser lido antes da exclusão.
ru: Сочетание клавиш этого макета не удалось прочитать перед удалением.
tr: Silme işleminden önce bu düzenin kısayolu okunamadı.
zh_hant: 刪除前無法讀取此佈局的快速鍵。
